# позначення
'''
перша координата першого вершини  х1
друга координата першої вершини   y1
перша координата другої вершини   x2
друга координата другої вершини   y2
перша координата третьої вершини  x3
друга координата третьої вершини  y3
перша сторона                    first_side
друга сторона                    second_side
третя сторона                    third_side
периметр                         perimetr
'''
# введення даних

import math

x1=int(input('Перша координа першої вершини: '))
y1=int(input('Друга координата першої вершини: '))
x2=int(input('Перша координа другої вершини: '))
y2=int(input('Друга координата другої вершини: '))
x3=int(input('Перша координа третьої вершини: '))
y3=int(input('Друга координата третьоїої вершини: '))
first_side=math.sqrt((x1-x2)**2+(y1-y2)**2)
second_side=math.sqrt((x3-x2)**2+(y3-y2)**2)
third_side=math.sqrt((x3-x1)**2+(y3-y1)**2)
perimetr=first_side+second_side+third_side

# виведення даних
print('Периметр трикутника {0:.2f}'.format(perimetr))



